public class TelephonDic {

    String[] phoneBook = {
            "Абрамов Иван — 8 (900) 123-45-67",
            "Баранов Сергей — 8 (900) 234-56-78",
            "Васильева Мария — 8 (900) 345-67-89",
            "Григорьев Алексей — 8 (900) 456-78-90",
            "Дмитриева Ольга — 8 (900) 567-89-01",
            "Егорова Наталья — 8 (900) 678-90-12",
            "Жуков Андрей — 8 (900) 789-01-23",
            "Зайцева Людмила — 8 (900) 890-12-34",
            "Иванова Светлана — 8 (900) 901-23-45",
            "Кузнецов Павел — 8 (900) 012-34-56",
            "Лебедева Татьяна — 8 (900) 123-45-67",
            "Михайлова Виктория — 8 (900) 234-56-78",
            "Новиков Дмитрий — 8 (900) 345-67-89",
            "Орлова Екатерина — 8 (900) 456-78-90",
            "Петров Александр — 8 (900) 567-89-01",
            "Романов Константин — 8 (900) 678-90-12",
            "Смирнова Ирина — 8 (900) 789-01-23",
            "Тимофеева Валерия — 8 (900) 890-12-34",
            "Федоров Роман — 8 (900) 901-23-45",
            "Шмидт Карина — 8 (900) 012-34-56"
    };

}
